## Plan Result (stg-global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-update-web&#34;]
* Delete
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dss-update-case&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["fis-ds-update-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/fis-ds-update-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dss-update-case"] will be destroyed
  # (because key ["dss-update-case"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dssupdatecaseaat" -> null
      - location                          = "global" -> null
      - mode                              = "Detection" -> null
      - name                              = "dssupdatecaseaat" -> null
      - resource_group_name               = "lz-aat-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null

          - exclusion {
              - match_variable = "QueryStringArgNames" -> null
              - operator       = "Equals" -> null
              - selector       = "rf" -> null
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1486,"Program":"tfcmt","SHA1":"","Target":"stg-global","Vars":{}} -->